日程安排/2020/2020.9.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-03 四 15:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2020-09</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry" />
<link rel='stylesheet' type='text/css' href='http://zxxky.cn/1.css'/>
</head>
<body>
<div id="content">
<h1 class="title">2020-09</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdcb6592">1. map</a>
<ul>
<li><a href="#org7854b74">1.1. make map</a>
<ul>
<li><a href="#org941eeb4">1.1.1. make(map[string]string, 0/B&lt;8)</a></li>
<li><a href="#org20dcc45">1.1.2. make(map[string]string,9)</a></li>
<li><a href="#org96c63ee">1.1.3. make map 的 ques</a></li>
</ul>
</li>
<li><a href="#org52949da">1.2. delete map</a>
<ul>
<li><a href="#org87f88b9">1.2.1. delete map 的 ques</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6c8b319">2. sync 同步原语</a>
<ul>
<li><a href="#org564b729">2.1. Mutex</a></li>
<li><a href="#orge59c79b">2.2. Mutex waitGroup</a></li>
<li><a href="#org25a0424">2.3. Mutex</a></li>
</ul>
</li>
<li><a href="#org7f4d46d">3. sync.map</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgdcb6592" class="outline-2">
<h2 id="orgdcb6592"><span class="section-number-2">1</span> map</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">

map --- &gt; 底层是 hmap  有着若干个bucket数组 ,
----&gt; 一个bucket保存8组 k-v ,超过8个就会 hash冲突
会在extra字段结构体中的 overflow 使用链地址法一直拓展下去

如果key超过8个就会映射到相同的桶 hash 冲突 --&gt;开放寻址或者链表法


</pre>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> hmap</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&lt;名称&gt;</td>
<td class="org-left">&lt;类型&gt;</td>
<td class="org-left">&lt;释义&gt;</td>
</tr>

<tr>
<td class="org-left">count</td>
<td class="org-left">int</td>
<td class="org-left">数量</td>
</tr>

<tr>
<td class="org-left">flags</td>
<td class="org-left">uint8</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">uint8</td>
<td class="org-left">包含2<sup>B个bucket</sup></td>
</tr>

<tr>
<td class="org-left">noverflow</td>
<td class="org-left">uint8</td>
<td class="org-left">溢出的bucket</td>
</tr>

<tr>
<td class="org-left">hash0</td>
<td class="org-left">uint32</td>
<td class="org-left">hash 种子</td>
</tr>

<tr>
<td class="org-left">buckets</td>
<td class="org-left">unsafe.pointer</td>
<td class="org-left">buckets的指针</td>
</tr>

<tr>
<td class="org-left">oldbuckets</td>
<td class="org-left">unsafe.pointer</td>
<td class="org-left">扩容时用的数组</td>
</tr>

<tr>
<td class="org-left">nevacuate</td>
<td class="org-left">uintptr</td>
<td class="org-left">进度</td>
</tr>

<tr>
<td class="org-left">extra</td>
<td class="org-left">*mapextra</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<pre class="example">
B ---&gt;  如果H.b 小于 16  -- &gt; noverflow ++ return
如果 H.b 大于 16 ---&gt;  { uint32(1) &gt;&gt; (b-15) -1} 的值  fastrand() ==0
----&gt; noverflow ++
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> bucket map</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&lt;名称&gt;</td>
<td class="org-left">&lt;类型&gt;</td>
<td class="org-left">&lt;释义&gt;</td>
</tr>

<tr>
<td class="org-left">topush</td>
<td class="org-left">[bucketCnt]uint8</td>
<td class="org-left">让查找key更快</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">类似打tag的方式</td>
</tr>

<tr>
<td class="org-left">hap并非只有一个</td>
<td class="org-left">tophash 是紧跟8组kv的模式</td>
<td class="org-left">使overflow 成为链表结构</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">key0key1key2 val1val2val3</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org7854b74" class="outline-3">
<h3 id="org7854b74"><span class="section-number-3">1.1</span> make map</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org941eeb4" class="outline-4">
<h4 id="org941eeb4"><span class="section-number-4">1.1.1</span> make(map[string]string, 0/B&lt;8)</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-go">
<span style="color: #81A1C1;">func</span> <span style="color: #8FBCBB;">makemap_small</span>() *<span style="color: #8FBCBB;">hmap</span> {
    <span style="color: #D8DEE9;">h</span> := <span style="color: #81A1C1;">new</span>(<span style="color: #8FBCBB;">hmap</span>)
    h.hash0 = <span style="color: #8FBCBB;">fastrand</span>()
    <span style="color: #81A1C1;">return</span> h
}
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">hint &#22914;&#26524;&#20026;0&#25110;&#32773;&#23567;&#20110;8 &#37027;&#20040;&#35843;&#29992;_small</span>
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#21019;&#24314;&#19968;&#20010; hmap&#30340;&#32467;&#26500;&#20307; &#21021;&#22987;&#21270;hash&#22240;&#23376;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org20dcc45" class="outline-4">
<h4 id="org20dcc45"><span class="section-number-4">1.1.2</span> make(map[string]string,9)</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
1 . h == nil 初始话 hmap  new(hamp)
2 . h.hash0 = fastrand() 初始话hash因子
3 . 判断B 的大小 , B++ 会调用 overLoadFactor(hint,0)true .
4 . 确定h.B 的个数后 分配内存 makeBucketArray(t,h.B,nil)
</pre>
</div>
</div>

<div id="outline-container-org96c63ee" class="outline-4">
<h4 id="org96c63ee"><span class="section-number-4">1.1.3</span> make map 的 ques</h4>
<div class="outline-text-4" id="text-1-1-3">
<pre class="example">
1 . var Mp map[string]int ----&gt; nil map 不可以赋值
2 . makemap 返回的是一个 *hmap slice 是一个 struct
</pre>
</div>
</div>
</div>

<div id="outline-container-org52949da" class="outline-3">
<h3 id="org52949da"><span class="section-number-3">1.2</span> delete map</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #81A1C1;">func</span> <span style="color: #8FBCBB;">mapdelete</span>(<span style="color: #D8DEE9;">t</span> *<span style="color: #8FBCBB;">maptype</span>, <span style="color: #D8DEE9;">h</span> *<span style="color: #8FBCBB;">hmap</span>, <span style="color: #D8DEE9;">key</span> <span style="color: #8FBCBB;">unsafe.Pointer</span>){}

<span style="color: #6f7787;">//</span><span style="color: #6f7787;">1 . &#26816;&#26597;&#26631;&#24535;&#20301;  h.flag &#26159;&#21542;&#24182;&#21457;&#20889;&#20837;</span>
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#28165;&#38500;key</span>
<span style="color: #81A1C1;">if</span> t.<span style="color: #8FBCBB;">indirectkey</span>() {
     *(*unsafe.Pointer)(k) = <span style="color: #81A1C1;">nil</span>
} <span style="color: #81A1C1;">else</span> <span style="color: #81A1C1;">if</span> t.key.ptrdata != 0 {
     <span style="color: #8FBCBB;">memclrHasPointers</span>(k, t.key.size)
}
<span style="color: #D8DEE9;">e</span> := <span style="color: #8FBCBB;">add</span>(unsafe.<span style="color: #8FBCBB;">Pointer</span>(b), dataOffset+bucketCnt*<span style="color: #8FBCBB;">uintptr</span>(t.keysize)+i*<span style="color: #8FBCBB;">uintptr</span>(t.elemsize))
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#28165;&#38500;value</span>
<span style="color: #81A1C1;">if</span> t.<span style="color: #8FBCBB;">indirectelem</span>() {
     *(*unsafe.Pointer)(e) = <span style="color: #81A1C1;">nil</span>
} <span style="color: #81A1C1;">else</span> <span style="color: #81A1C1;">if</span> t.elem.ptrdata != 0 {
     <span style="color: #8FBCBB;">memclrHasPointers</span>(e, t.elem.size)
} <span style="color: #81A1C1;">else</span> {
     <span style="color: #8FBCBB;">memclrNoHeapPointers</span>(e, t.elem.size)
}
     b.tophash[i] = emptyOne

</pre>
</div>
</div>
<div id="outline-container-org87f88b9" class="outline-4">
<h4 id="org87f88b9"><span class="section-number-4">1.2.1</span> delete map 的 ques</h4>
<div class="outline-text-4" id="text-1-2-1">
<pre class="example">
1 . 不可以并行读写 , 可以加锁 .
读之前调用 RLock() 函数，读完之后调用 RUnlock() 函数解锁
写之前调用 Lock() 函数，写完之后，调用 Unlock() 解锁。
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org6c8b319" class="outline-2">
<h2 id="org6c8b319"><span class="section-number-2">2</span> sync 同步原语</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org564b729" class="outline-3">
<h3 id="org564b729"><span class="section-number-3">2.1</span> Mutex</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">

1 . 结构
type Mutex struct{
   state int32
   sema  uint32
}

2 . 状态
{
  1 . MutexLocked ---&gt; 表示锁定
  2 . MutexWoken  ---&gt; 从正常被唤醒
  3 . MutexStarving --- &gt; 从互斥到饥饿状态
  4 . waitersCount  ----&gt; 在互斥锁等的G的个数
}

3 . 因为刚被唤起的Goroutine 与 新的 Goroutine
    竞争时很容易得不到锁,所以把一个goroutine超过1ms
    没有获取到锁,它就会将当前互斥锁切换饥饿模式,防止
    部分goroutine被饿死
</pre>
</div>
</div>

<div id="outline-container-orge59c79b" class="outline-3">
<h3 id="orge59c79b"><span class="section-number-3">2.2</span> Mutex waitGroup</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #81A1C1;">func</span> <span style="color: #8FBCBB;">TestDc</span>(<span style="color: #D8DEE9;">t</span> *<span style="color: #8FBCBB;">testing.T</span>){
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">waitGroup &#19968;&#20010;&#31561;&#24453;&#30340;&#26631;&#24535;&#21543;</span>
     <span style="color: #D8DEE9;">wg</span> := <span style="color: #8FBCBB;">sync.WaitGroup</span>{}
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#24320;&#21551;&#20004;&#20010;&#26680;&#24515;</span>
     runtime.<span style="color: #8FBCBB;">GOMAXPROCS</span>(2)
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#32473;&#20182;&#21152;100 &#20010;  --&gt; &#21040; 0 &#23601;&#20250; &#32467;&#26463;</span>
     wg.<span style="color: #8FBCBB;">Add</span>(100)
     <span style="color: #81A1C1;">for</span> <span style="color: #D8DEE9;">i</span>:=0;i&lt;100;i++{
             t.<span style="color: #8FBCBB;">Log</span>(<span style="color: #A3BE8C;">"&#31532;"</span>,i,<span style="color: #A3BE8C;">"&#27425;"</span>)
             <span style="color: #81A1C1;">go</span> <span style="color: #81A1C1;">func</span>() {
                     t.<span style="color: #8FBCBB;">Log</span>(<span style="color: #A3BE8C;">"1"</span>)
             }()
             <span style="color: #81A1C1;">go</span> <span style="color: #81A1C1;">func</span>() {
                     t.<span style="color: #8FBCBB;">Log</span>(<span style="color: #A3BE8C;">"2"</span>)
             }()

             <span style="color: #81A1C1;">go</span> <span style="color: #81A1C1;">func</span>() {
                     t.<span style="color: #8FBCBB;">Log</span>(<span style="color: #A3BE8C;">"3"</span>)
             }()
             wg.<span style="color: #8FBCBB;">Done</span>() <span style="color: #6f7787;">// </span><span style="color: #6f7787;">done &#23601;&#26159; -1 , 100-1</span>
             time.<span style="color: #8FBCBB;">Sleep</span>(1*time.Second)
     }

     wg.<span style="color: #8FBCBB;">Wait</span>() <span style="color: #6f7787;">// </span><span style="color: #6f7787;">wait &#23601;&#32467;&#26463;</span>
}
<span style="color: #81A1C1;">func</span> <span style="color: #8FBCBB;">main</span>(){
    <span style="color: #8FBCBB;">TestDc</span>()
}
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">ques &#27599;&#27425;&#37117;&#26159; &#19979;&#38754;&#37027;&#20010;go func &#25191;&#34892;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #81A1C1;">func</span> <span style="color: #8FBCBB;">main</span>(){
   fmt.<span style="color: #8FBCBB;">Println</span>(<span style="color: #A3BE8C;">"hello"</span>)
}
</pre>
</div>
</div>
</div>



<div id="outline-container-org25a0424" class="outline-3">
<h3 id="org25a0424"><span class="section-number-3">2.3</span> Mutex</h3>
</div>
</div>

<div id="outline-container-org7f4d46d" class="outline-2">
<h2 id="org7f4d46d"><span class="section-number-2">3</span> sync.map</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-go">

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-09-15</p>
<p class="author">Author: rzry</p>
<p class="date">Created: 2020-12-03 四 15:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
